<template>
    <div style="overflow: hidden; height:79vh;">
    <hot-table :root="root" :data="workData" :settings="hotSettings" ref="WorkRecordsHotGird"></hot-table>
    </div>
</template>


<script>
import HotTable from 'vue-handsontable-official';
import Handsontable from 'handsontable';

function holidayRenderer(instance, td, row, col, prop, value, cellProperties) {
  Handsontable.renderers.NumericRenderer.apply(this, arguments);
  td.style.background = '#F88';
}


export default {
  name: 'WorkRecordsHotTable',
  props: ['data'],
  components: {
    HotTable
  },
  data () {
    return {
        workData:
            [
            ["作番","プロジェクト名","作業ID","作業名称","日","21","22","23","24","25","26","27","28","29","30","31","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20"],
            ["","","","","曜日","日","月","火","水","木","金","土","日","月","火","水","木","金","土","日","月","火","水","木","金","土","日","祝","火","水","木","金","土","日","月","火"],
            ["","","","","残業","***","-8.00 ","-8.00 ","-8.00 ","-8.00 ","-8.00 ","***","***","-8.00 ","-8.00 ","-8.00 ","-8.00 ","-8.00 ","***","***","-8.00 ","-8.00 ","-8.00 ","-8.00 ","-8.00 ","***","***","***","-8.00 ","-8.00 ","-8.00 ","-8.00 ","***","***","-8.00 ","-8.00 "],
            ["","","","","休出","0.00 ","","","","","","0.00 ","0.00 ","","","","","","0.00 ","0.00 ","","","","","","0.00 ","0.00 ","0.00 ","","","","","0.00 ","0.00 ","",""],
            ["","","","","深夜","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","合計","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 ","0.00 "],
            ["","","","","年休","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","時年","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","遅刻","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","早退","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","変則","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","211","運用設計 : 運用設計","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","212","運用設計 : 顧客レビュー","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","221","基本設計 : 基本設計書作成","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","222","基本設計 : サイト設計","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","223","基本設計 : 顧客レビュー","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","231","機能設計 : 機能設計書作成","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","232","機能設計 : 顧客レビュー","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","241","詳細設計 : 詳細設計","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","242","詳細設計 : モックアップデザイン","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","243","詳細設計 : 顧客レビュー","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","251","開発環境構築 : 開発環境構築","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","261","技術調査 : 技術調査","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","271","開発 : コーディング","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","272","開発 : PCL作成","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","273","開発 : 単体テスト","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","281","結合テスト : CCL作成","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","282","結合テスト : 組み合わせテスト","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","291","総合テスト : 総合テスト（システムテスト）","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["1730310","AA工業：生産管理","301","運用テスト : 運用テスト","0.00 ","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
            ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
        ],

      root: 'testhot',
      hotSettings: {
        columns: [
            {}, {}, {}, {}, {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {renderer: holidayRenderer, type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},
            {type: 'numeric', numericFormat: {pattern: '0,0.00'}},],
        enterBeginsEditing: false,
        rowHeights: 28,
        minSpareRows: 1,
        minRows: 20,
        contextMenu: true,
        fixedColumnsLeft: 5,
        fixedRowsTop: 11,
        wordWrap: false,
        autoWrapCol: false,
        autoWrapRow: false,
        mergeCells: [
            {row: 0, col: 0, rowspan: 11, colspan: 1},
            {row: 0, col: 1, rowspan: 11, colspan: 1},
            {row: 0, col: 2, rowspan: 11, colspan: 1},
            {row: 0, col: 3, rowspan: 11, colspan: 1},
        ],
        afterChange: (changes, source) => {
        console.log(source)
            if(source === 'edit' || source === 'CopyPaste.paste' || source === 'Autofill.fill') {
                let startRow = 11;
                let startCol = 5;
                changes.forEach(([row, col, oldValue, newValue]) => {
                    if(row >= startRow && col >= startCol) {
                        let sumRow = 0
                        for(let r = startRow; r < this.workData.length; r++) {
                            sumRow += Number(this.workData[r][col])
                        }
                        this.workData[5][col] = sumRow
                        this.workData[2][col] = sumRow-8

                        let sumCol = 0

                        for(let c = startCol; c < this.workData[0].length; c++) {
                            sumCol += Number(this.workData[row][c])
                        }
                        this.workData[row][4] = sumCol
                    }
                    this.$refs.WorkRecordsHotGird.table.render()
                });
            }
        },
      },
    }
  },
}

</script>


<style>
    .lightcoral {
        background-color: '#888888';
    }

</style>